app/controllers/api/tickets_controller.rb

INSERT INTO "tickets" ("owner_id", "venue_id", "event_id", "price", "row", "section", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["owner_id", 25], ["venue_id", 12], ["event_id", 2], ["price", 99.99], ["row", 2], ["section", 5], ["created_at", "2019-07-09 22:13:28.773020"], ["updated_at", "2019-07-09 22:13:28.773020"]]
---
    def create
        @ticket = Ticket.new(ticket_params)

        if @ticket.save